
## Plan Result (stg)




<pre><code>Plan: 8 to add, 6 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_resource_group.bootstrap_rg
  * module.kv_hmi_boostrap.azurerm_key_vault.kv
  * module.kv_hmi_boostrap.azurerm_key_vault_access_policy.creator_access_policy
  * module.kv_hmi_boostrap.azurerm_key_vault_access_policy.developer[0]
  * module.kv_hmi_boostrap.azurerm_key_vault_access_policy.implicit_managed_identity_access_policy[0]
  * module.kv_hmi_boostrap.azurerm_key_vault_access_policy.product_team_access_policy
  * module.kv_hmi_boostrap.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_hmi_boostrap.azurerm_user_assigned_identity.managed_identity[0]
* Update
  * azurerm_automation_account.automation_account
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_schedule.trigger_once
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_schedule.trigger_once
  * module.sa.azurerm_storage_account.storage_account


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_automation_account.automation_account will be updated in-place
  ~ resource "azurerm_automation_account" "automation_account" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa"
        name                          = "hmi-stg-aa"
        tags                          = {
            "application"         = "hearings-management-interface"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#hearing-management-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Hearing Management Information"
        }
        # (10 unchanged attributes hidden)

      ~ identity {
          ~ identity_ids = [
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/hmi-stg-mi",
                # (2 unchanged elements hidden)
            ]
            # (3 unchanged attributes hidden)
        }
    }

  # azurerm_resource_group.bootstrap_rg will be created
  + resource "azurerm_resource_group" "bootstrap_rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "hmi-bootstrap-stg-rg"
      + tags     = {
          + "application"         = "hearings-management-interface"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#hearing-management-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Hearing Management Information"
        }
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_schedule.schedule will be updated in-place
  ~ resource "azurerm_automation_schedule" "schedule" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/schedules/rotate-sas-tokens-hmisastg-rota-rl-schedule"
        name                    = "rotate-sas-tokens-hmisastg-rota-rl-schedule"
      ~ start_time              = "2025-07-30T01:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_schedule.trigger_once will be updated in-place
  ~ resource "azurerm_automation_schedule" "trigger_once" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/schedules/rotate-sas-tokens-hmisastg-rota-rl-schedule-single-trigger"
        name                    = "rotate-sas-tokens-hmisastg-rota-rl-schedule-single-trigger"
      ~ start_time              = "2025-07-29T15:03:00Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].azurerm_automation_schedule.schedule will be updated in-place
  ~ resource "azurerm_automation_schedule" "schedule" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/schedules/rotate-sas-tokens-hmisastg-rota-rlw-schedule"
        name                    = "rotate-sas-tokens-hmisastg-rota-rlw-schedule"
      ~ start_time              = "2025-07-30T01:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].azurerm_automation_schedule.trigger_once will be updated in-place
  ~ resource "azurerm_automation_schedule" "trigger_once" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/schedules/rotate-sas-tokens-hmisastg-rota-rlw-schedule-single-trigger"
        name                    = "rotate-sas-tokens-hmisastg-rota-rlw-schedule-single-trigger"
      ~ start_time              = "2025-07-29T15:03:00Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.kv_hmi_boostrap.azurerm_key_vault.kv will be created
  + resource "azurerm_key_vault" "kv" {
      + access_policy                   = (known after apply)
      + enabled_for_deployment          = true
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = true
      + id                              = (known after apply)
      + location                        = "uksouth"
      + name                            = "hmi-bootstrap-kv-stg"
      + public_network_access_enabled   = true
      + purge_protection_enabled        = true
      + resource_group_name             = "hmi-bootstrap-stg-rg"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 90
      + tags                            = {
          + "application"         = "hearings-management-interface"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#hearing-management-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Hearing Management Information"
        }
      + tenant_id                       = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + vault_uri                       = (known after apply)

      + contact (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

  # module.kv_hmi_boostrap.azurerm_key_vault_access_policy.creator_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "creator_access_policy" {
      + certificate_permissions = [
          + "Create",
          + "Delete",
          + "DeleteIssuers",
          + "Get",
          + "GetIssuers",
          + "Import",
          + "List",
          + "ListIssuers",
          + "SetIssuers",
          + "Update",
          + "ManageContacts",
          + "ManageIssuers",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Create",
          + "List",
          + "Get",
          + "Delete",
          + "Update",
          + "Import",
          + "Backup",
          + "Restore",
          + "Decrypt",
          + "Encrypt",
          + "UnwrapKey",
          + "WrapKey",
          + "Sign",
          + "Verify",
          + "GetRotationPolicy",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "7ef3b6ce-3974-41ab-8512-c3ef4bb8ae01"
      + secret_permissions      = [
          + "Set",
          + "List",
          + "Get",
          + "Delete",
          + "Recover",
          + "Purge",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.kv_hmi_boostrap.azurerm_key_vault_access_policy.developer[0] will be created
  + resource "azurerm_key_vault_access_policy" "developer" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.kv_hmi_boostrap.azurerm_key_vault_access_policy.implicit_managed_identity_access_policy[0] will be created
  + resource "azurerm_key_vault_access_policy" "implicit_managed_identity_access_policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = (known after apply)
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.kv_hmi_boostrap.azurerm_key_vault_access_policy.product_team_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      + certificate_permissions = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "ManageContacts",
          + "ManageIssuers",
          + "GetIssuers",
          + "ListIssuers",
          + "SetIssuers",
          + "DeleteIssuers",
          + "Recover",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Recover",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "7bde62e7-b39f-487c-95c9-b4c794fdbb96"
      + secret_permissions      = [
          + "List",
          + "Set",
          + "Delete",
          + "Recover",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.kv_hmi_boostrap.azurerm_monitor_diagnostic_setting.kv-ds will be created
  + resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
      + name                           = "hmi-bootstrap-kv-stg"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category       = "AuditEvent"
            # (1 unchanged attribute hidden)
        }

      + enabled_metric (known after apply)

      + metric (known after apply)
    }

  # module.kv_hmi_boostrap.azurerm_user_assigned_identity.managed_identity[0] will be created
  + resource "azurerm_user_assigned_identity" "managed_identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "hmi-stg-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-stg-rg"
      + tags                = {
          + "application"         = "hearings-management-interface"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#hearing-management-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Hearing Management Information"
        }
      + tenant_id           = (known after apply)
    }

  # module.sa.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.Storage/storageAccounts/hmisastg"
        name                               = "hmisastg"
        tags                               = {
            "application"         = "hearings-management-interface"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#hearing-management-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Hearing Management Information"
        }
        # (97 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

Plan: 8 to add, 6 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":86,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->